app/views/topics/index.html.erb

SELECT  `responses`.* FROM `responses` WHERE (`responses`.`created_at` BETWEEN '2017-08-25 00:00:00' AND '2017-08-25 23:59:59') ORDER BY `responses`.`id` ASC LIMIT 1
SELECT COUNT(*) AS count_all, `responses`.`topic_id` AS responses_topic_id FROM `responses` WHERE (`responses`.`created_at` BETWEEN '2017-08-26 00:00:00' AND '2017-08-28 23:59:59') GROUP BY `responses`.`topic_id`
---
<%= link_to "#{topic.title}", topic_responses_path(topic.id), method: :get %>
<p>レス数: <%= topic.responses.length %> 勢い: