app/controllers/responses_controller.rb

  def index
    @responses = Response.where(topic_id: params[:topic_id])
    @topic = Topic.find(params[:topic_id])
---
SELECT `responses`.* FROM `responses` WHERE `responses`.`topic_id` = 1
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 6 LIMIT 1

  def new
    @topic = Topic.find(params[:topic_id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = NULL LIMIT 1

  def create
    binding.pry
    Response.create(response_params)
---
INSERT INTO `responses` (`body`, `topic_id`, `user_id`, `created_at`, `updated_at`) VALUES ('aa', 2, 1, '2017-07-11 03:00:48', '2017-07-11 03:00:48')