app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics` ORDER BY created_at DESC
SELECT  `responses`.* FROM `responses` WHERE (`responses`.`created_at` BETWEEN '2017-08-25 00:00:00' AND '2017-08-25 23:59:59') ORDER BY `responses`.`id` ASC LIMIT 1
SELECT COUNT(*) AS count_all, `responses`.`topic_id` AS responses_topic_id FROM `responses` WHERE (`responses`.`created_at` BETWEEN '2017-08-26 00:00:00' AND '2017-08-28 23:59:59') GROUP BY `responses`.`topic_id`
---
  def index
    @topics = Topic.all.order('created_at DESC')
    @responses = Response.where(created_at: Date.yesterday.beginning_of_day..Date.tomorrow.end_of_day).group(:topic_id).count

INSERT INTO `topics` (`title`, `created_at`, `updated_at`) VALUES ('最近の高田馬場くさくね？', '2017-07-10 13:36:32', '2017-07-10 13:36:32')
---
  def create
    Topic.create(topic_params)